---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsType
source: html/efa84f53-19fa-039b-c5bb-8fcb72e09878.htm
---
# Autodesk.Revit.DB.Architecture.StairsType

A type element containing the properties for a component-based stair.

## Syntax (C#)
```csharp
public class StairsType : ElementType
```